#+TITLE: 面试题 08.06. Hanota LCCI
#+DATE: 2020-09-28 17:20
#+LAST_MODIFIED: 2020-09-28 17:20
#+STARTUP: overview
#+HUGO_WEIGHT: auto
#+HUGO_AUTO_SET_LASTMOD: t
#+EXPORT_FILE_NAME: 面试题-08.06-hanota-lcci
#+HUGO_BASE_DIR:~/G/blog
#+HUGO_SECTION: leetcode
#+HUGO_CATEGORIES:leetcode
#+HUGO_TAGS: Leetcode Algorithms Recursion

** Solution I: Recursion
- ~n=2~
#+BEGIN_EXAMPLE
        A   B   C
        1
        0


Step1:  0   1        A->B

Step2:      1   0    A->C

                1
Step3:          0    B->C

#+END_EXAMPLE

- ~n=3~
#+BEGIN_EXAMPLE

         A   B   C   From->To
         2
         1
         0

         1
Step-2:  0   2       A->B

Step-1:  0   2   1   A->C

                 2
Step 0:  0       1   B->C


n=n-1
----------------------------------

             2
Step 1:  0   1       A->B

             2
Step 2:      1   0   A->C

                 2
                 1
Step 3:          0   B->C
#+END_EXAMPLE

In which ~Step 1 -> Step 3~ is a recursive process.

1. Case ~n == 1~: move from ~A~ to ~C~ (where recursion returns);
2. Case ~n  > 1~:
   a. move ~n-1~ from ~A~ to ~B~;
   b. move  ~n1~ from ~A~ to ~C~;
   c. move ~n-1~ from ~B~ to ~C~;

#+BEGIN_SRC go :exports both :imports "fmt"
var steps int
func hanoi(n int, A, B, C string)  {
	if n == 1 {
		steps++
		fmt.Printf("Move From %s->%s\n", A, C)
		return
	}
	hanoi(n-1, A, C, B)
	hanoi(1, A, B, C)
	hanoi(n-1, B, A, C)
}

func main() {
	hanoi(3, "A", "B", "C")
	fmt.Printf("Moved %d steps\n", steps)
}
#+END_SRC

#+RESULTS:
: Move From A->C
: Move From A->B
: Move From C->B
: Move From A->C
: Move From B->A
: Move From B->C
: Move From A->C
: Moved 7 steps


